#124. Напишіть програму на Python для вводу двох цілих чисел
# в одному рядку.

# Введення двох цілих чисел в одному рядку
input_str = input("Введіть два цілих числа розділені пробілом: ")

# Розділення рядка на два числа за допомогою методу split()
numbers = input_str.split()

# Перетворення двох рядкових значень на цілі числа
try:
    num1 = int(numbers[0])
    num2 = int(numbers[1])

    # Виведення результату
    print("Перше число:", num1)
    print("Друге число:", num2)

except ValueError:
    print("Помилка: Введіть два цілі числа, розділені пробілом.")
