#5. Напишіть програму на Python, яка приймає ім'я та прізвище користувача та друкує їх у прямому
#порядку з пробілом між ними та у зворотньому порядку

if __name__ == "__main__":
    # Введення ім'я та прізвища від користувача
    first_name = input("Введіть ім'я: ")
    last_name = input("Введіть прізвище: ")

    # Друк у прямому порядку з пробілом між ім'ям та прізвищем
    full_name_forward = f"{first_name} {last_name}"
    print("Прямий порядок:", full_name_forward)

    # Друк у зворотньому порядку з пробілом між ім'ям та прізвищем
    full_name_reverse = f"{last_name} {first_name}"
    print("Зворотній порядок:", full_name_reverse)
