#4. Напишіть програму на Python, яка приймає радіус круги від користувача та обчислює площа.
#Приклад виведення:
#г = 1,1
#Площа = 3.8013271108436504

import math

def calculate_circle_area(radius):
    # Обчислення площі круга за формулою: A = π * r^2
    area = math.pi * radius ** 2
    return area


if __name__ == "__main__":
    # Введення радіусу круга від користувача
    try:
        radius = float(input("Введіть радіус круга: "))

        # Перевірка, чи введений радіус є додатнім числом
        if radius > 0:
            # Виклик функції для обчислення площі круга
            circle_area = calculate_circle_area(radius)

            # Виведення результату
            print(f"Площа круга з радіусом {radius}: {circle_area}")
        else:
            print("Радіус повинен бути додатнім числом.")
    except ValueError:
        print("Будь ласка, введіть коректне числове значення для радіусу.")
