# Вправа 12. Створити масив одиниць розміром n×n та створити в ньому «рамку», що утворюється з 0.
# In [2] task_12()
# 4
# Out [2] [[0. 0. 0. 0.]
# [0. 1. 1. 0.]
# [0. 1. 1. 0.]
# [0. 0. 0. 0.]]

import numpy as np


def create_frame_array(n):
    # Створення масиву з одиниць
    array = np.ones((n, n))

    # Заміна внутрішніх елементів на 0
    array[1:-1, 1:-1] = 0

    return array


def task_12():
    # Введення розміру масиву
    n = int(input("Введіть розмір масиву (n): "))

    # Створення та виведення масиву
    result_array = create_frame_array(n)
    print(result_array)


# Виклик функції для введення розміру та виведення результату
task_12()
